app/controllers/responses_controller.rb

  def create
    @response = Response.new(response_params)

    respond_to do |format|
      if @response.save
---
INSERT INTO "responses" ("r11", "r12", "r13", "r21", "r22", "r23", "r24", "r25", "r26", "r27", "r28", "r31", "r32", "r41", "r42", "r51", "r52", "r53", "r54", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)